SOAP Project ISBN Checker.postman_collection.json

{
  "info": {
    "_postman_id": "e5c5c5ad-ae21-4b65-8e0c-83caa82e2139",
    "name": "SOAP Project ISBN Checker",
    "schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
    "_exporter_id": "48228024",
    "_collection_link": "https://go.postman.co/collection/48228024-e5c5c5ad-ae21-4b65-8e0c-83caa82e2139?source=collection_link"
  },
  "item": [
    {
      "name": "TC#1_Positive",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN13 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>978-8194790839</sISBN>\r\n    </IsValidISBN13>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "https://webservices.daehosting.com/services/isbnservice.wso",
          "protocol": "https",
          "host": [
            "webservices",
            "daehosting",
            "com"
          ],
          "path": [
            "services",
            "isbnservice.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "TC#2_Negative Invalid ISBN",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN13 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>978-8194790839</sISBN>\r\n    </IsValidISBN13>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "https://webservices.daehosting.com/services/isbnservice.wso",
          "protocol": "https",
          "host": [
            "webservices",
            "daehosting",
            "com"
          ],
          "path": [
            "services",
            "isbnservice.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "TC#3_Negative",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN13 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>978-8194790839</sISBN>\r\n    </IsValidISBN13>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "https://webservices.daehosting.com/services/isbnservice.wso",
          "protocol": "https",
          "host": [
            "webservices",
            "daehosting",
            "com"
          ],
          "path": [
            "services",
            "isbnservice.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "TC#4_Negative Invalid Headers (Bug)",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN13 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>978-8194790839</sISBN>\r\n    </IsValidISBN13>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "https://webservices.daehosting.com/services/isbnservice.wso",
          "protocol": "https",
          "host": [
            "webservices",
            "daehosting",
            "com"
          ],
          "path": [
            "services",
            "isbnservice.wso"
          ]
        }
      },
      "response": []
    },
    {
      "name": "TC#5_Negative Chinees character",
      "request": {
        "method": "POST",
        "header": [
          {
            "key": "Content-Type",
            "value": "text/xml; charset=utf-8",
            "type": "text"
          }
        ],
        "body": {
          "mode": "raw",
          "raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <IsValidISBN13 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n      <sISBN>978-8194790839</sISBN>\r\n    </IsValidISBN13>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "options": {
            "raw": {
              "language": "xml"
            }
          }
        },
        "url": {
          "raw": "https://webservices.daehosting.com/services/isbnservice.wso",
          "protocol": "https",
          "host": [
            "webservices",
            "daehosting",
            "com"
          ],
          "path": [
            "services",
            "isbnservice.wso"
          ]
        }
      },
      "response": []
    }
  ]
}