Project#1-SOAP Project ISBN Checker.postman_collection.json

{
	"info": {
		"_postman_id": "73c11fef-0a58-49f2-a1f0-b275a2048d14",
		"name": "Project#1-SOAP Project ISBN Checker",
		"description": "This API is basically going to check if a 10-digit book ISBN number is valid or not.",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "48852054",
		"_collection_link": "https://suresh-spsw-5066813.postman.co/workspace/a262764a-02cd-40cd-aecf-e65204e1a7d9/collection/48852054-73c11fef-0a58-49f2-a1f0-b275a2048d14?action=share&source=collection_link&creator=48852054"
	},
	"item": [
		{
			"name": "TC#1-Positive",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n <soap:Body>\r\n  <IsValidISBN10 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n    <sISBN>99921-58-10-7</sISBN>\r\n  </IsValidISBN10>\r\n </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://webservices.daehosting.com/services/isbnservice.wso",
					"protocol": "https",
					"host": [
						"webservices",
						"daehosting",
						"com"
					],
					"path": [
						"services",
						"isbnservice.wso"
					]
				}
			},
			"response": []
		},
		{
			"name": "TC#2-Negative",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n <soap:Body>\r\n  <IsValidISBN10 xmlns=\"http://webservices.daehosting.com/ISBN\">\r\n    <sISBN>19921-58-10-7</sISBN>\r\n  </IsValidISBN10>\r\n </soap:Body>\r\n</soap:Envelope>",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://webservices.daehosting.com/services/isbnservice.wso",
					"protocol": "https",
					"host": [
						"webservices",
						"daehosting",
						"com"
					],
					"path": [
						"services",
						"isbnservice.wso"
					]
				}
			},
			"response": []
		}
	]
}